In [1]:
import pandas as pd
kenya_df=pd.DataFrame({
    'city':['Nairobi','Kisumu','Nakuru'],
    'temperature':[27,25,23],
    'humidity':[34,38,46]
})
kenya_df

      city  temperature  humidity
0  Nairobi           27        34
1   Kisumu           25        38
2   Nakuru           23        46

In [6]:
us_df=pd.DataFrame({
    'city':['New york','California'],
    'temperature':[34,40],
    'humidity':[50,45]
})
us_df

         city  temperature  humidity
0    New york           34        50
1  California           40        45

In [8]:
df=pd.concat([kenya_df,us_df],ignore_index=True)
df

         city  temperature  humidity
0     Nairobi           27        34
1      Kisumu           25        38
2      Nakuru           23        46
3    New york           34        50
4  California           40        45

In [9]:
df=pd.concat([kenya_df,us_df],keys=['Kenya','USA'])
df

               city  temperature  humidity
Kenya 0     Nairobi           27        34
      1      Kisumu           25        38
      2      Nakuru           23        46
USA   0    New york           34        50
      1  California           40        45

In [14]:
df.loc['USA']

         city  temperature  humidity
0    New york           34        50
1  California           40        45

In [20]:
temperature_df=pd.DataFrame({
    'city':['Nairobi','Kisumu','Nakuru'],
    'temperature':[27,25,23],
},index=[0,1,2])
temperature_df

      city  temperature
0  Nairobi           27
1   Kisumu           25
2   Nakuru           23

In [21]:
humidity_df=pd.DataFrame({
    'city':['Kisumu','Nairobi','Nakuru'],
    'humidity':[34,38,46]
},index=[1,0,2])
humidity_df

      city  humidity
1   Kisumu        34
0  Nairobi        38
2   Nakuru        46

In [22]:
df=pd.concat([temperature_df,humidity_df],axis=1)
df

      city  temperature     city  humidity
0  Nairobi           27  Nairobi        38
1   Kisumu           25   Kisumu        34
2   Nakuru           23   Nakuru        46

In [23]:
mySeries=pd.Series(['Sunny','Cloudy','Rainy'],name='event')
mySeries

0     Sunny
1    Cloudy
2     Rainy
Name: event, dtype: object

In [24]:
humidity_df

      city  humidity
1   Kisumu        34
0  Nairobi        38
2   Nakuru        46

In [28]:
df1=pd.concat([humidity_df,mySeries],axis=1)
df1

      city  humidity   event
0  Nairobi        38   Sunny
1   Kisumu        34  Cloudy
2   Nakuru        46   Rainy

In [29]:
df2=pd.concat([df1,temperature_df],axis=1)
df2

      city  humidity   event     city  temperature
0  Nairobi        38   Sunny  Nairobi           27
1   Kisumu        34  Cloudy   Kisumu           25
2   Nakuru        46   Rainy   Nakuru           23